package ru.itmo.web.hw4.util;

public class PostContainer {
    public static String post1 = """
            <p>Привет, Codeforces!</p>
           
            <p>В <a class="contest-time" href="https://www.timeanddate.com/worldclock/fixedtime.html?day=20&amp;month=10&amp;year=2022&amp;hour=17&amp;min=35&amp;sec=0&amp;p1=166">четверг, 20 октября 2022 г. в 17:35</a> состоится Educational Codeforces Round 138 (Rated for Div. 2).</p>
       
            <p>Продолжается серия образовательных раундов в рамках инициативы Harbour.Space University! Подробности о сотрудничестве Harbour.Space University и Codeforces можно прочитать в посте.</p>
                        
            <p>Этот раунд будет рейтинговым <b>для участников с рейтингом менее 2100</b>. Соревнование будет проводиться по немного расширенным правилам ICPC. Штраф за каждую неверную посылку до посылки, являющейся полным решением, равен 10 минутам. После окончания раунда будет период времени длительностью в 12 часов, в течение которого вы можете попробовать взломать абсолютно любое решение (в том числе свое). Причем исходный код будет предоставлен не только для чтения, но и для копирования.</p>
                        
            <p>Вам будет предложено <b>6 или 7 задач на 2 часа</b>. Мы надеемся, что вам они покажутся интересными.</p>
                        
            <p>Задачи вместе со мной придумывали и готовили Адилбек adedalic Далабаев, Владимир vovuh Петров, Иван BledDest Андросов и Максим Neon Мещеряков. Также большое спасибо Михаилу MikeMirzayanov Мирзаянову за системы Polygon и Codeforces.</p>
                        
            <p>Удачи в раунде! Успешных решений!</p>
            """;

    public static String post2 = """
            <p>Привет! В воскресенье, 16 октября 2022 г. в 17:35 начнётся Codeforces Round #828 (Div. 3) — очередной Codeforces раунд для третьего дивизиона. В этом раунде будет 6-8 задач, которые подобраны по сложности так, чтобы составить интересное соревнование для участников с рейтингами до 1600. Однако все желающие, чей рейтинг 1600 и выше могут зарегистрироваться на раунд вне конкурса.</p>
                        
            <p>Раунд пройдет по правилам образовательных раундов. Таким образом, во время раунда задачи будут тестироваться на предварительных тестах, а после раунда будет 12-ти часовая фаза открытых взломов. Мы постарались сделать приличные тесты — так же как и вы, мы будем расстроены, если у многих будут падать решения после окончания контеста.</p>
            """;

    public static String post3 = """
            <p>On суббота, 15 октября 2022 г. в 17:35 we will host Codeforces Global Round 23.</p>
                        
            <p>It is the fifth round of a 2022 series of Codeforces Global Rounds. The rounds are open and rated for everybody.</p>
                        
            <p>The prizes for this round:</p>
            
            <ul>
                <li>30 best participants get a t-shirt.</li>
                <li>20 t-shirts are randomly distributed among those with ranks between 31 and 500, inclusive.</li>
            </ul>
            """;
}
